In [1]:
import numpy as np
import pandas as pd

In [3]:
group1 = { "Name" : [ "Hans", "Anna", "John", "Mohammed","Tom"],
             "Job" : ["Computer Engineer", "Fashion designer", "Gardener ", "Jeweller ", "Cook"]}

In [4]:
mergeDf1 = pd.DataFrame(group1)
mergeDf1

       Name                Job
0      Hans  Computer Engineer
1      Anna   Fashion designer
2      John          Gardener
3  Mohammed          Jeweller
4       Tom               Cook

In [5]:
group2 = { "Name" : [ "Hans", "Anna", "John", "Mohammed","Tom"],
             "Car" : ["Daimler", "Ford", "Nissan ", "Audi ", "Mazda"]}

In [6]:
mergeDf2 = pd.DataFrame(group2)
mergeDf2

       Name      Car
0      Hans  Daimler
1      Anna     Ford
2      John  Nissan
3  Mohammed    Audi
4       Tom    Mazda

In [7]:
pd.merge(mergeDf1, mergeDf2, on = "Name")

       Name                Job      Car
0      Hans  Computer Engineer  Daimler
1      Anna   Fashion designer     Ford
2      John          Gardener   Nissan
3  Mohammed          Jeweller     Audi
4       Tom               Cook    Mazda